
// 此处数据使用了按行组织的模式，所以需要使用 DataSet 的 fold 方法对数据进行加工
var data = [{
  name: '支付宝',
  '红包': 50,
  '公司食堂': 10 + 11.72 +24.2,
  '烤鱼': 0,
  '麦德龙': 0 ,
  '超市': 110.7 + 8.8 + 65.3 + 21.6 +34.9+9.78+54.21+41.6,
  '外卖': 6+ 109+45,
  '其他': 3 + 21.72 +14 +215.72,
  '翻墙':60.43,
  '话费':40+ 4.72,
  '车票':185.64 + 19.5 + 331 -168 -163 + 337 + 17.5,
    '迪卡侬':95.7,
    '信用卡':33.09,
    '网购':20.72,
    '住宿':145,
  '总共':0,
}, {
  name: '微信',
  '红包': 10,
  '公司食堂': 30,
  '烤鱼': 83,
  '麦德龙': 122 + 95 + 15.51 ,
  '超市': 56.3 + 16.5,
  '外卖': 27,
  '其他': 4.8 + 8 +25 + 4,
  '总共':10+30+83+122 + 95 + 15.51+56.3 + 16.5+ 27+4.8 + 8 +25 + 4
}];
var ds = new DataSet();
var dv = ds.createView().source(data);
dv.transform({
  type: 'fold',
  fields: ['红包', '公司食堂', '烤鱼', '麦德龙', '超市', '翻墙','话费','车票','外卖', '其他','总共'], // 展开字段集
  key: '流向', // key字段
  value: '消费' // value字段
});

var chart = new G2.Chart({
  container: 'mountNode',
  forceFit: true,
  height: window.innerHeight
});
chart.source(dv);
chart.intervalStack().position('流向*消费').color('name');
chart.render();
